Melt()

In [1]:
import pandas as pd

In [5]:
var = pd.DataFrame(
    {
        "Days" : [1,2,3,4,5,6],
        "English" : [10,12,13,14,15,15],
        "Maths" : [16,17,18,19,20,21],
    }
)
var

   Days  English  Maths
0     1       10     16
1     2       12     17
2     3       13     18
3     4       14     19
4     5       15     20
5     6       15     21

In [6]:
pd.melt(var)

   variable  value
0      Days      1
1      Days      2
2      Days      3
3      Days      4
4      Days      5
5      Days      6
6   English     10
7   English     12
8   English     13
9   English     14
10  English     15
11  English     15
12    Maths     16
13    Maths     17
14    Maths     18
15    Maths     19
16    Maths     20
17    Maths     21

In [7]:
pd.melt(var,id_vars=["English"])

    English variable  value
0        10     Days      1
1        12     Days      2
2        13     Days      3
3        14     Days      4
4        15     Days      5
5        15     Days      6
6        10    Maths     16
7        12    Maths     17
8        13    Maths     18
9        14    Maths     19
10       15    Maths     20
11       15    Maths     21

In [9]:
pd.melt(var,id_vars=["English"],var_name="python",value_name ="wscube")

    English python  wscube
0        10   Days       1
1        12   Days       2
2        13   Days       3
3        14   Days       4
4        15   Days       5
5        15   Days       6
6        10  Maths      16
7        12  Maths      17
8        13  Maths      18
9        14  Maths      19
10       15  Maths      20
11       15  Maths      21